khoatbd55/NRF24L01-LedControl-PSOC/LedControl/LedControl.cydsn/nrf24.c
// Functions to manage the nRF24L01+ transceiver
#include "project.h"
#include "nrf24.h"

#define nRF24_CSN_L SPI_NRF_CS_Write(0);
#define nRF24_CSN_H SPI_NRF_CS_Write(1);
#define nRF24_CE_H SPI_NRF_CE_Write(1);
#define nRF24_CE_L SPI_NRF_CE_Write(0);

// The address used to test presence of the transceiver,
// note: should not exceed 5 bytes
#define nRF24_TEST_ADDR            "KHANG"


// Addresses of the address registers
static const uint8_t nRF24_ADDR_REGS[7] = {
		nRF24_REG_RX_ADDR_P0,
		nRF24_REG_RX_ADDR_P1,
		nRF24_REG_RX_ADDR_P2,
		nRF24_REG_RX_ADDR_P3,
		nRF24_REG_RX_ADDR_P4,
		nRF24_REG_RX_ADDR_P5,
		nRF24_REG_TX_ADDR
};

uint8_t nRF24_LL_RW(uint8_t b)
{
    SPI_NRF_SpiUartClearTxBuffer();
    SPI_NRF_SpiUartClearRxBuffer();
    SPI_NRF_SpiUartWriteTxData(b);
    int32_t timeOutUs=1000;
    uint8_t result=0,count=1;
    do
    {
        if(SPI_NRF_SpiUartGetRxBufferSize()>0)
        {
            result=SPI_NRF_SpiUartReadRxData();
            count--;
        }
        CyDelayUs(1);
        timeOutUs--;
    }
    while(count!=0 && timeOutUs>0);
    SPI_NRF_SpiUartClearTxBuffer();
    SPI_NRF_SpiUartClearRxBuffer();
    return result;
}

// Reads a value of register
// input:
//   reg - number of register to read
// return: value of register
static uint8_t nRF24_ReadReg(uint8_t reg) {
	uint8_t value;
	nRF24_CSN_L;
	nRF24_LL_RW(reg & nRF24_MASK_REG_MAP);
	value = nRF24_LL_RW(nRF24_CMD_NOP);
	nRF24_CSN_H;

	return value;
}

// Writes a new value to the register
// input:
//   reg - number of register to write
//   value - value to write
static void nRF24_WriteReg(uint8_t reg, uint8_t value) {
	nRF24_CSN_L;
	if (reg < nRF24_CMD_W_REGISTER) {
		// This is a register access
		nRF24_LL_RW(nRF24_CMD_W_REGISTER | (reg & nRF24_MASK_REG_MAP));
		nRF24_LL_RW(value);
	} else {
		// This is a single byte command or future command/register
		nRF24_LL_RW(reg);
		if ((reg != nRF24_CMD_FLUSH_TX) && (reg != nRF24_CMD_FLUSH_RX) && \
				(reg != nRF24_CMD_REUSE_TX_PL) && (reg != nRF24_CMD_NOP)) {
			// Send register value
			nRF24_LL_RW(value);
		}
	}
	nRF24_CSN_H;
}

// Reads to the buffer from a multi-byte register
// input:
//   reg - number of register to read
//   pBuf - pointer to the buffer for register data
//   count - number of bytes to read
static void nRF24_ReadMBReg(uint8_t reg, uint8_t *pBuf, uint8_t count) {
	nRF24_CSN_L;
	nRF24_LL_RW(reg);
	while (count--)
	{
		*pBuf++ = nRF24_LL_RW(nRF24_CMD_NOP);
	}
	nRF24_CSN_H;
}

// Writes a buffer to a multi-byte register
// input:
//   reg - number of register to write
//   pBuf - pointer to the buffer with data to write
//   count - number of bytes to write
static void nRF24_WriteMBReg(uint8_t reg, uint8_t *pBuf, uint8_t count) {
	nRF24_CSN_L;
	nRF24_LL_RW(reg);
	while (count--) {
		nRF24_LL_RW(*pBuf++);
	}
	nRF24_CSN_H;
}

void nRF24_MasterInit(void) 
{
	nRF24_CSN_H;
		nRF24_SetPowerMode(nRF24_PWR_DOWN);
        nRF24_Check();

		nRF24_WriteReg(nRF24_REG_CONFIG,     0x08);
		nRF24_WriteReg(nRF24_REG_EN_AA,      0x3F);
		nRF24_WriteReg(nRF24_REG_EN_RXADDR,  0x03);
		nRF24_WriteReg(nRF24_REG_SETUP_AW,   0x03);
		nRF24_WriteReg(nRF24_REG_SETUP_RETR, 0x03);
		nRF24_WriteReg(nRF24_REG_RF_CH,      0x02);
		nRF24_WriteReg(nRF24_REG_RF_SETUP,   0x0E);
		nRF24_WriteReg(nRF24_REG_STATUS,     0x00);
		nRF24_WriteReg(nRF24_REG_RX_PW_P0,   0x00);
		nRF24_WriteReg(nRF24_REG_RX_PW_P1,   0x00);
		nRF24_WriteReg(nRF24_REG_RX_PW_P2,   0x00);
		nRF24_WriteReg(nRF24_REG_RX_PW_P3,   0x00);
		nRF24_WriteReg(nRF24_REG_RX_PW_P4,   0x00);
		nRF24_WriteReg(nRF24_REG_RX_PW_P5,   0x00);
		nRF24_WriteReg(nRF24_REG_DYNPD,      0x00);
		nRF24_WriteReg(nRF24_REG_FEATURE,    0x00);

		// Configure the default RX/TX address values
		uint8_t addr[5];
		uint8_t idx;
		for (idx = 0U; idx < sizeof(addr); idx++) {
			addr[idx] = 0xE7;
		}
		nRF24_SetAddr(nRF24_PIPETX, addr);
		nRF24_SetAddr(nRF24_PIPE0, addr);
		for (idx = 0U; idx < sizeof(addr); idx++) {
			addr[idx] = 0xC2;
		}
		nRF24_SetAddr(nRF24_PIPE1, addr);
		for (idx = 2U; idx < 6U; idx++) {
			addr[0] = idx + 0xC1;
			nRF24_SetAddr(idx, addr);
		}

		// Clear the FIFO's
		nRF24_FlushRX();
		nRF24_FlushTX();

		// Clear any pending interrupt flags
		nRF24_ClearIRQFlags();

		// Configure RX PIPE#1
		static const uint8_t nRF24_ADDR[] = { 'K' ,'H' , 'A', 'N', 'G'};
		nRF24_CE_L;
		nRF24_SetCRCScheme(nRF24_CRC_2byte); // 1-byte CRC scheme
		nRF24_SetPowerMode(nRF24_PWR_DOWN);
		nRF24_DisableAA(0xFF); // disable ShockBurst
		nRF24_SetRFChannel(115); // set RF channel
		nRF24_SetDataRate(nRF24_DR_250kbps); // 2Mbit/s data rate
		//nRF24_SetCRCScheme(nRF24_CRC_2byte); // 1-byte CRC scheme
		nRF24_SetAddrWidth(5); // address width is 5 bytes
		nRF24_SetTXPower(nRF24_TXPWR_0dBm); // configure TX power

		nRF24_SetAddr(nRF24_PIPETX, nRF24_ADDR); // program TX address
		//=== add here
		nRF24_SetAddr(nRF24_PIPE0, nRF24_ADDR); // program pipe#0 RX address, must be same as TX (for ACK packets)
		nRF24_SetRXPipe(nRF24_PIPE0, nRF24_AA_OFF, 6); // enable RX pipe#1 with Auto-ACK: disabled, payload length: 6 bytes
		//=== end here

		nRF24_SetOperationalMode(nRF24_MODE_TX); // switch transceiver to the TX mode
		// Clear any pending IRQ flags
		nRF24_ClearIRQFlags();
		nRF24_SetPowerMode(nRF24_PWR_UP); // wake-up transceiver (in case if it sleeping)
		CyDelay(2);
		// RX/TX disabled
		nRF24_CE_L;
}



// Configures the transceiver to its initial state
void nRF24_SlaveInit() {
    nRF24_CSN_H;
    nRF24_SetPowerMode(nRF24_PWR_DOWN);
    nRF24_Check();
    // Write to the registers their initial values
	nRF24_WriteReg(nRF24_REG_CONFIG,     0x08);
	nRF24_WriteReg(nRF24_REG_EN_AA,      0x3F);
	nRF24_WriteReg(nRF24_REG_EN_RXADDR,  0x03);
	nRF24_WriteReg(nRF24_REG_SETUP_AW,   0x03);
	nRF24_WriteReg(nRF24_REG_SETUP_RETR, 0x03);
	nRF24_WriteReg(nRF24_REG_RF_CH,      0x02);
	nRF24_WriteReg(nRF24_REG_RF_SETUP,   0x0E);
	nRF24_WriteReg(nRF24_REG_STATUS,     0x00);
	nRF24_WriteReg(nRF24_REG_RX_PW_P0,   0x00);
	nRF24_WriteReg(nRF24_REG_RX_PW_P1,   0x00);
	nRF24_WriteReg(nRF24_REG_RX_PW_P2,   0x00);
	nRF24_WriteReg(nRF24_REG_RX_PW_P3,   0x00);
	nRF24_WriteReg(nRF24_REG_RX_PW_P4,   0x00);
	nRF24_WriteReg(nRF24_REG_RX_PW_P5,   0x00);
	nRF24_WriteReg(nRF24_REG_DYNPD,      0x00);
	nRF24_WriteReg(nRF24_REG_FEATURE,    0x00);

	// Configure the default RX/TX address values
	uint8_t addr[5];
	uint8_t idx;
	for (idx = 0U; idx < sizeof(addr); idx++) {
		addr[idx] = 0xE7;
	}
	nRF24_SetAddr(nRF24_PIPETX, addr);
	nRF24_SetAddr(nRF24_PIPE0, addr);
	for (idx = 0U; idx < sizeof(addr); idx++) {
		addr[idx] = 0xC2;
	}
	nRF24_SetAddr(nRF24_PIPE1, addr);
	for (idx = 2U; idx < 6U; idx++) {
		addr[0] = idx + 0xC1;
		nRF24_SetAddr(idx, addr);
	}

