khoatbd55/NRF24L01-LedControl-PSOC/LedControl/LedControl.cydsn/nrf24.c
	// SETUP_RETR
	i = nRF24_ReadReg(nRF24_REG_SETUP_RETR);
	__printf("[0x%02X][0x%02X] ARD=%04b ARC=%04b (retr.delay=%uus, count=%u)\r\n",
			nRF24_REG_SETUP_RETR,
			i,
			i >> 4,
			i & 0x0F,
			((i >> 4) * 250) + 250,
			i & 0x0F
		);

	// RF_CH
	i = nRF24_ReadReg(nRF24_REG_RF_CH);
	__printf("[0x%02X][0x%02X] RF channel:%u (%.3uGHz)\r\n",
			nRF24_REG_RF_CH,
			i,
			i,
			2400 + i
		);

	// RF_SETUP
	i = nRF24_ReadReg(nRF24_REG_RF_SETUP);
	__printf("[0x%02X][0x%02X] CONT_WAVE:%s PLL_LOCK:%s DataRate=",
			nRF24_REG_RF_SETUP,
			i,
			(i & 0x80) ? "ON" : "OFF",
			(i & 0x80) ? "ON" : "OFF"
		);
	switch ((i & 0x28) >> 3) {
		case 0x00:
			__printf("1M");
			break;
		case 0x01:
			__printf("2M");
			break;
		case 0x04:
			__printf("250k");
			break;
		default:
			__printf("???");
			break;
	}
	__printf("pbs RF_PWR=");
	switch ((i & 0x06) >> 1) {
		case 0x00:
			__printf("-18");
			break;
		case 0x01:
			__printf("-12");
			break;
		case 0x02:
			__printf("-6");
			break;
		case 0x03:
			__printf("0");
			break;
		default:
			__printf("???");
			break;
	}
	__printf("dBm\r\n");

	// STATUS
	i = nRF24_ReadReg(nRF24_REG_STATUS);
	__printf("[0x%02X][0x%02X] IRQ:%03b RX_PIPE:%u TX_FULL:%s\r\n",
			nRF24_REG_STATUS,
			i,
			(i & 0x70) >> 4,
			(i & 0x0E) >> 1,
			(i & 0x01) ? "YES" : "NO"
		);
	// OBSERVE_TX
	i = nRF24_ReadReg(nRF24_REG_OBSERVE_TX);
	__printf("[0x%02X][0x%02X] PLOS_CNT=%u ARC_CNT=%u\r\n",
			nRF24_REG_OBSERVE_TX,
			i,
			i >> 4,
			i & 0x0F
		);
	// RPD
	i = nRF24_ReadReg(nRF24_REG_RPD);
	__printf("[0x%02X][0x%02X] RPD=%s\r\n",
			nRF24_REG_RPD,
			i,
			(i & 0x01) ? "YES" : "NO"
		);

	// TX_ADDR
	nRF24_ReadMBReg(nRF24_REG_TX_ADDR, buf, aw);
	__printf("[0x%02X] TX_ADDR:    ", nRF24_REG_TX_ADDR);
	for (i = 0; i < aw; i++) { __printf("0x%02x ", buf[i]); }
	__printf("[");
	for (i = 0; i < aw; i++) { __printf("%c", buf[i]); }
	__printf("]\r\n");

	// RX_ADDR_P0
	nRF24_ReadMBReg(nRF24_REG_RX_ADDR_P0, buf, aw);
	__printf("[0x%02X] RX_ADDR_P0: ", nRF24_REG_RX_ADDR_P0);
	for (i = 0; i < aw; i++) { __printf("0x%02x ", buf[i]); }
	__printf("[");
	for (i = 0; i < aw; i++) { __printf("%c", buf[i]); }
	__printf("]\r\n");

	// RX_ADDR_P1
	nRF24_ReadMBReg(nRF24_REG_RX_ADDR_P1, buf, aw);
	__printf("[0x%02X] RX_ADDR_P1: ", nRF24_REG_RX_ADDR_P1);
	for (i = 0; i < aw; i++) { __printf("0x%02x ", buf[i]); }
	__printf("[");
	for (i = 0; i < aw; i++) { __printf("%c", buf[i]); }
	__printf("]\r\n");

	// RX_ADDR_P2
	buf[aw - 1] = nRF24_ReadReg(nRF24_REG_RX_ADDR_P2);
	__printf("[0x%02X] RX_ADDR_P2: ", nRF24_REG_RX_ADDR_P2);
	for (i = 0; i < aw; i++) { __printf("0x%02x ", buf[i]); }
	__printf("[");
	for (i = 0; i < aw; i++) { __printf("%c", buf[i]); }
	__printf("]\r\n");

	// RX_ADDR_P3
	buf[aw - 1] = nRF24_ReadReg(nRF24_REG_RX_ADDR_P3);
	__printf("[0x%02X] RX_ADDR_P3: ", nRF24_REG_RX_ADDR_P3);
	for (i = 0; i < aw; i++) { __printf("0x%02x ", buf[i]); }
	__printf("[");
	for (i = 0; i < aw; i++) { __printf("%c", buf[i]); }
	__printf("]\r\n");

	// RX_ADDR_P4
	buf[aw - 1] = nRF24_ReadReg(nRF24_REG_RX_ADDR_P4);
	__printf("[0x%02X] RX_ADDR_P4: ", nRF24_REG_RX_ADDR_P4);
	for (i = 0; i < aw; i++) { __printf("0x%02x ", buf[i]); }
	__printf("[");
	for (i = 0; i < aw; i++) { __printf("%c", buf[i]); }
	__printf("]\r\n");

	// RX_ADDR_P5
	buf[aw - 1] = nRF24_ReadReg(nRF24_REG_RX_ADDR_P5);
	__printf("[0x%02X] RX_ADDR_P5: ", nRF24_REG_RX_ADDR_P5);
	for (i = 0; i < aw; i++) { __printf("0x%02x ", buf[i]); }
	__printf("[");
	for (i = 0; i < aw; i++) { __printf("%c", buf[i]); }
	__printf("]\r\n");

	// RX_PW_P0
	__printf("[0x%02X] RX_PW_P0=%u\r\n", nRF24_REG_RX_PW_P0, nRF24_ReadReg(nRF24_REG_RX_PW_P0));
	// RX_PW_P1
	__printf("[0x%02X] RX_PW_P1=%u\r\n", nRF24_REG_RX_PW_P1, nRF24_ReadReg(nRF24_REG_RX_PW_P1));
	// RX_PW_P2
	__printf("[0x%02X] RX_PW_P2=%u\r\n", nRF24_REG_RX_PW_P2, nRF24_ReadReg(nRF24_REG_RX_PW_P2));
	// RX_PW_P3
	__printf("[0x%02X] RX_PW_P3=%u\r\n", nRF24_REG_RX_PW_P3, nRF24_ReadReg(nRF24_REG_RX_PW_P3));
	// RX_PW_P4
	__printf("[0x%02X] RX_PW_P4=%u\r\n", nRF24_REG_RX_PW_P4, nRF24_ReadReg(nRF24_REG_RX_PW_P4));
	// RX_PW_P5
	__printf("[0x%02X] RX_PW_P5=%u\r\n", nRF24_REG_RX_PW_P5, nRF24_ReadReg(nRF24_REG_RX_PW_P5));
}

#endif // nRF24_DumpConfig()
